___

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" alt="CLRSWY"></p>

___

<h1><p style="text-align: center;">Pandas Lesson, Session - 10</p><h1>

<h1><p style="text-align: center;">Working with Text and Time Data</p><h1>

# Working with Text Data

## String Methods
https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html

https://www.w3schools.com/python/python_ref_string.asp

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

In [2]:
df = pd.read_excel("text_exercise.xlsx")
df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMİTH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         IT      data scientist   "$135,000"  40
7  E0006   Albert simon         IT      data scientist  125000dolar  35

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          8 non-null      object
 1   staff       8 non-null      object
 2   department  8 non-null      object
 3   job         8 non-null      object
 4   salary      8 non-null      object
 5   age         8 non-null      object
dtypes: object(6)
memory usage: 512.0+ bytes

___

- **lower()		  =>** Converts a string into lower case
- **upper()		  =>** Converts a string into upper case
- **capitalize()  =>** Converts the first character to upper case
- **title()		  =>** Converts the first character of each word to upper case
- **swapcase()    =>** Swaps the case lower/upper

___

In [4]:
df.staff

0         Tom BLUE
1       JOHN BLACK
2    Micheal Brown
3     jason walker
4       Alex Green
5      OSCAR SMİTH
6      Adrian STAR
7     Albert simon
Name: staff, dtype: object

In [6]:
df.staff.str.title()

0         Tom Blue
1       John Black
2    Micheal Brown
3     Jason Walker
4       Alex Green
5     Oscar Smi̇th
6      Adrian Star
7     Albert Simon
Name: staff, dtype: object

In [7]:
df.staff.str.lower()

0         tom blue
1       john black
2    micheal brown
3     jason walker
4       alex green
5     oscar smi̇th
6      adrian star
7     albert simon
Name: staff, dtype: object

In [8]:
df.staff.str.upper()

0         TOM BLUE
1       JOHN BLACK
2    MICHEAL BROWN
3     JASON WALKER
4       ALEX GREEN
5      OSCAR SMİTH
6      ADRIAN STAR
7     ALBERT SIMON
Name: staff, dtype: object

In [10]:
df.staff.str.capitalize()

0         Tom blue
1       John black
2    Micheal brown
3     Jason walker
4       Alex green
5     Oscar smi̇th
6      Adrian star
7     Albert simon
Name: staff, dtype: object

In [11]:
df.staff.str.swapcase()

0         tOM blue
1       john black
2    mICHEAL bROWN
3     JASON WALKER
4       aLEX gREEN
5     oscar smi̇th
6      aDRIAN star
7     aLBERT SIMON
Name: staff, dtype: object

___

- **isalpha()     =>** Returns True if all characters in the string are in the alphabet
- **isnumeric()   =>** Returns True if all characters in the string are numeric
- **isalnum()     =>** Returns True if all characters in the string are alphanumeric
- **endswith()	=>** Returns true if the string ends with the specified value
- **startswith()	=>** Returns true if the string starts with the specified value
- **contains()	=>** Returns a Boolean value True for each element if the substring contains in the element, else False.

___

In [12]:
df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMİTH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         IT      data scientist   "$135,000"  40
7  E0006   Albert simon         IT      data scientist  125000dolar  35

In [14]:
df.job.str.isalpha()

0     True
1     True
2    False
3     True
4    False
5    False
6    False
7    False
Name: job, dtype: bool

In [15]:
df.age.str.isnumeric()

0      NaN
1      NaN
2      NaN
3      NaN
4    False
5      NaN
6      NaN
7      NaN
Name: age, dtype: object

In [16]:
df.age.astype("str").str.isnumeric()

0     True
1     True
2     True
3     True
4    False
5     True
6     True
7     True
Name: age, dtype: bool

In [18]:
df.salary

0     "$150,000"
1     "$180,000"
2     "$150,000"
3    130000dolar
4     "$110,000"
5     "$120,000"
6     "$135,000"
7    125000dolar
Name: salary, dtype: object

In [19]:
df.salary.str.isalnum()

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7     True
Name: salary, dtype: bool

In [20]:
df.job

0               manager
1               manager
2        data scientist
3             recruiter
4     backend developer
5    frontend developer
6        data scientist
7        data scientist
Name: job, dtype: object

In [21]:
df.job.str.startswith('data')

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7     True
Name: job, dtype: bool

In [22]:
df[df.job.str.startswith('data')]

      id          staff department             job       salary age
2  E0001  Micheal Brown         IT  data scientist   "$150,000"  35
6  E0005    Adrian STAR         IT  data scientist   "$135,000"  40
7  E0006   Albert simon         IT  data scientist  125000dolar  35

In [23]:
df.job.str.endswith('developer')

0    False
1    False
2    False
3    False
4     True
5     True
6    False
7    False
Name: job, dtype: bool

In [25]:
df.job.str.contains('data')

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7     True
Name: job, dtype: bool

In [26]:
df.salary

0     "$150,000"
1     "$180,000"
2     "$150,000"
3    130000dolar
4     "$110,000"
5     "$120,000"
6     "$135,000"
7    125000dolar
Name: salary, dtype: object

In [27]:
df.salary.str.contains(r"[a-z]", regex=True)

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7     True
Name: salary, dtype: bool

we can use these string methods which returning boolean expression for creating condition and so selecting relative rows

In [28]:
df[df.job.str.contains('data')]

      id          staff department             job       salary age
2  E0001  Micheal Brown         IT  data scientist   "$150,000"  35
6  E0005    Adrian STAR         IT  data scientist   "$135,000"  40
7  E0006   Albert simon         IT  data scientist  125000dolar  35

In [30]:
df.loc[df.job.str.contains('data'), 'department'] = 'DS'

In [31]:
df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         DS      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMİTH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         DS      data scientist   "$135,000"  40
7  E0006   Albert simon         DS      data scientist  125000dolar  35

In [33]:
df.loc[df.job.str.contains('data'), 'department'] = 'IT'
df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMİTH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         IT      data scientist   "$135,000"  40
7  E0006   Albert simon         IT      data scientist  125000dolar  35

___

- **replace() =>** Returns a string where a specified value is replaced with a specified value

- **split()	=>** Splits the string at the specified separator, and returns a list

- **strip()	=>** Returns a trimmed version of the string

- **find()	=>** Searches the string for a specified value and returns the position of where it was found

- **findall()	=>** Returns a list of all occurrence of the pattern.

- **join()	=>** Converts the elements of an iterable into a string

___

In [34]:
df

      id          staff department                 job       salary age
0  M0001       Tom BLUE         HR             manager   "$150,000"  52
1  M0002     JOHN BLACK         IT             manager   "$180,000"  48
2  E0001  Micheal Brown         IT      data scientist   "$150,000"  35
3  E0002   jason walker         HR           recruiter  130000dolar  38
4  E0003     Alex Green         IT   backend developer   "$110,000"   -
5  E0004    OSCAR SMİTH         IT  frontend developer   "$120,000"  32
6  E0005    Adrian STAR         IT      data scientist   "$135,000"  40
7  E0006   Albert simon         IT      data scientist  125000dolar  35

In [38]:
df.salary.str.strip('\"')

0       $150,000
1       $180,000
2       $150,000
3    130000dolar
4       $110,000
5       $120,000
6       $135,000
7    125000dolar
Name: salary, dtype: object

In [39]:
df.salary.str.strip('\"').str.rstrip('dolar')

0    $150,000
1    $180,000
2    $150,000
3      130000
4    $110,000
5    $120,000
6    $135,000
7      125000
Name: salary, dtype: object

In [40]:
df.salary.str.strip('\"').str.rstrip('dolar').str.lstrip('$')

0    150,000
1    180,000
2    150,000
3     130000
4    110,000
5    120,000
6    135,000
7     125000
Name: salary, dtype: object

In [41]:
df.salary.str.strip('\"$dolar')

0    150,000
1    180,000
2    150,000
3     130000
4    110,000
5    120,000
6    135,000
7     125000
Name: salary, dtype: object

In [42]:
df.salary.str.strip('\"$dolar').dtype

dtype('O')

In [44]:
df.salary.str.strip('\"$dolar').str.replace(",","")

0    150000
1    180000
2    150000
3    130000
4    110000
5    120000
6    135000
7    125000
Name: salary, dtype: object

In [45]:
df.salary.str.strip('\"$dolar').str.replace(",","").astype('float')

0    150000.0
1    180000.0
2    150000.0
3    130000.0
4    110000.0
5    120000.0
6    135000.0
7    125000.0
Name: salary, dtype: float64

In [46]:
df['salary'] = df.salary.str.strip('\"$dolar').str.replace(",","").astype('float')

In [47]:
df

      id          staff department                 job    salary age
0  M0001       Tom BLUE         HR             manager  150000.0  52
1  M0002     JOHN BLACK         IT             manager  180000.0  48
2  E0001  Micheal Brown         IT      data scientist  150000.0  35
3  E0002   jason walker         HR           recruiter  130000.0  38
4  E0003     Alex Green         IT   backend developer  110000.0   -
5  E0004    OSCAR SMİTH         IT  frontend developer  120000.0  32
6  E0005    Adrian STAR         IT      data scientist  135000.0  40
7  E0006   Albert simon         IT      data scientist  125000.0  35

In [48]:
df.age

0    52
1    48
2    35
3    38
4     -
5    32
6    40
7    35
Name: age, dtype: object

In [49]:
df.age.replace('-',np.nan)

0    52.0
1    48.0
2    35.0
3    38.0
4     NaN
5    32.0
6    40.0
7    35.0
Name: age, dtype: float64

In [ ]:
df.age.replace('-',np.nan)
# df.age.str.replace('-',np.nan) # gives an error

In [50]:
df['age'] = df.age.replace('-',np.nan)
df.age

0    52.0
1    48.0
2    35.0
3    38.0
4     NaN
5    32.0
6    40.0
7    35.0
Name: age, dtype: float64

**str.replace() vs .replace()**

- **Purpose:** Use **str.replace** for substring replacements on a single string column, and **replace** for any general replacement on one or more columns.

- **Usage:** **str.replace** can replace one thing at a time. **replace** lets you perform multiple independent replacements, i.e., replace many things at once.

- **Default behavior:** **str.replace** enables regex replacement by default. **replace** only performs a full match unless the regex=True switch is used.

In [51]:
df.staff

0         Tom BLUE
1       JOHN BLACK
2    Micheal Brown
3     jason walker
4       Alex Green
5      OSCAR SMİTH
6      Adrian STAR
7     Albert simon
Name: staff, dtype: object

In [52]:
df.staff.str.title().str.split()

0         [Tom, Blue]
1       [John, Black]
2    [Micheal, Brown]
3     [Jason, Walker]
4       [Alex, Green]
5     [Oscar, Smi̇th]
6      [Adrian, Star]
7     [Albert, Simon]
Name: staff, dtype: object

In [53]:
df.staff.str.title().str.split().str[0]

0        Tom
1       John
2    Micheal
3      Jason
4       Alex
5      Oscar
6     Adrian
7     Albert
Name: staff, dtype: object

In [56]:
df["name"] = df.staff.str.title().str.split().str[0]
df["sir_name"] = df.staff.str.title().str.split().str[1]
df.drop("staff", axis=1, inplace=True)

AttributeError: 'DataFrame' object has no attribute 'staff'

In [57]:
df

      id department                 job    salary   age     name sir_name
0  M0001         HR             manager  150000.0  52.0      Tom     Blue
1  M0002         IT             manager  180000.0  48.0     John    Black
2  E0001         IT      data scientist  150000.0  35.0  Micheal    Brown
3  E0002         HR           recruiter  130000.0  38.0    Jason   Walker
4  E0003         IT   backend developer  110000.0   NaN     Alex    Green
5  E0004         IT  frontend developer  120000.0  32.0    Oscar   Smi̇th
6  E0005         IT      data scientist  135000.0  40.0   Adrian     Star
7  E0006         IT      data scientist  125000.0  35.0   Albert    Simon

In [58]:
df.job.str.find('s')

0   -1
1   -1
2    5
3   -1
4   -1
5   -1
6    5
7    5
Name: job, dtype: int64

In [59]:
df.job.str.findall('s')

0        []
1        []
2    [s, s]
3        []
4        []
5        []
6    [s, s]
7    [s, s]
Name: job, dtype: object

In [60]:
df.job.str.findall('s').apply(len)

0    0
1    0
2    2
3    0
4    0
5    0
6    2
7    2
Name: job, dtype: int64

In [61]:
df["skills"] = [[],["Java","C++"],["Python","Tableau","SQL"],[],["React","Django"],["JavaScript","Python"],["R","SQL"],["SQL","Python"]]
df["Skills"] = [[],[],["Python","Tableau","SQL"],[],["React","Django"],["JavaScript","Python"],["R","SQL"],["SQL","Python"]]
df.loc[1, "Skills"] = "Java,C++"
df

,id,department,job,salary,age,name,sir_name,skills,Skills
0,M0001,HR,manager,150000.0,52.0,Tom,Blue,[],[]
1,M0002,IT,manager,180000.0,48.0,John,Black,"[Java, C++]","Java,C++"
2,E0001,IT,data scientist,150000.0,35.0,Micheal,Brown,"[Python, Tableau, SQL]","[Python, Tableau, SQL]"
3,E0002,HR,recruiter,130000.0,38.0,Jason,Walker,[],[]
4,E0003,IT,backend developer,110000.0,NaN,Alex,Green,"[React, Django]","[React, Django]"
5,E0004,IT,frontend developer,120000.0,32.0,Oscar,Smi̇th,"[JavaScript, Python]","[JavaScript, Python]"
6,E0005,IT,data scientist,135000.0,40.0,Adrian,Star,"[R, SQL]","[R, SQL]"
7,E0006,IT,data scientist,125000.0,35.0,Albert,Simon,"[SQL, Python]","[SQL, Python]"

In [63]:
df.skills.str.join(",")

0
1              Java,C++
2    Python,Tableau,SQL
3
4          React,Django
5     JavaScript,Python
6                 R,SQL
7            SQL,Python
Name: skills, dtype: object

In [64]:
df.Skills.str.join(",")

0
1       J,a,v,a,,,C,+,+
2    Python,Tableau,SQL
3
4          React,Django
5     JavaScript,Python
6                 R,SQL
7            SQL,Python
Name: Skills, dtype: object

In [65]:
df.Skills.apply(lambda x: ",".join(x) if type(x) == list else x)

0
1              Java,C++
2    Python,Tableau,SQL
3
4          React,Django
5     JavaScript,Python
6                 R,SQL
7            SQL,Python
Name: Skills, dtype: object

In [67]:
[",".join(x) if type(x) == list else x for x in df.Skills]

['',
 'Java,C++',
 'Python,Tableau,SQL',
 '',
 'React,Django',
 'JavaScript,Python',
 'R,SQL',
 'SQL,Python']

In [68]:
df['Skills'] = [",".join(x) if type(x) == list else x for x in df.Skills]
df.Skills

0
1              Java,C++
2    Python,Tableau,SQL
3
4          React,Django
5     JavaScript,Python
6                 R,SQL
7            SQL,Python
Name: Skills, dtype: object

## Dummy Operation

### get_dummies()


1. pd.get_dummies(df/df["col_name"])


2. df["col_name"].get_dummies(sep = ",")

In [69]:
df.department

0    HR
1    IT
2    IT
3    HR
4    IT
5    IT
6    IT
7    IT
Name: department, dtype: object

In [70]:
pd.get_dummies(df.department)

   HR  IT
0   1   0
1   0   1
2   0   1
3   1   0
4   0   1
5   0   1
6   0   1
7   0   1

In [71]:
pd.get_dummies(df.department, drop_first=True)

   IT
0   0
1   1
2   1
3   0
4   1
5   1
6   1
7   1

In [72]:
df.Skills

0
1              Java,C++
2    Python,Tableau,SQL
3
4          React,Django
5     JavaScript,Python
6                 R,SQL
7            SQL,Python
Name: Skills, dtype: object

In [73]:
df.Skills.str.get_dummies(sep=',')

   C++  Django  Java  JavaScript  Python  R  React  SQL  Tableau
0    0       0     0           0       0  0      0    0        0
1    1       0     1           0       0  0      0    0        0
2    0       0     0           0       1  0      0    1        1
3    0       0     0           0       0  0      0    0        0
4    0       1     0           0       0  0      1    0        0
5    0       0     0           1       1  0      0    0        0
6    0       0     0           0       0  1      0    1        0
7    0       0     0           0       1  0      0    1        0

In [74]:
df.Skills.str.get_dummies(sep=',').add_prefix('skills_')

,skills_C++,skills_Django,skills_Java,skills_JavaScript,skills_Python,skills_R,skills_React,skills_SQL,skills_Tableau
0,0,0,0,0,0,0,0,0,0
1,1,0,1,0,0,0,0,0,0
2,0,0,0,0,1,0,0,1,1
3,0,0,0,0,0,0,0,0,0
4,0,1,0,0,0,0,1,0,0
5,0,0,0,1,1,0,0,0,0
6,0,0,0,0,0,1,0,1,0
7,0,0,0,0,1,0,0,1,0

In [75]:
skill_dummy = df.Skills.str.get_dummies(sep=',').add_prefix('skills_')

In [77]:
df_final = df[['id','department', 'job', 'salary', 'Skills']]
df_final

      id department                 job    salary              Skills
0  M0001         HR             manager  150000.0
1  M0002         IT             manager  180000.0            Java,C++
2  E0001         IT      data scientist  150000.0  Python,Tableau,SQL
3  E0002         HR           recruiter  130000.0
4  E0003         IT   backend developer  110000.0        React,Django
5  E0004         IT  frontend developer  120000.0   JavaScript,Python
6  E0005         IT      data scientist  135000.0               R,SQL
7  E0006         IT      data scientist  125000.0          SQL,Python

In [78]:
df_final.join(skill_dummy)

,id,department,job,salary,Skills,skills_C++,skills_Django,skills_Java,skills_JavaScript,skills_Python,skills_R,skills_React,skills_SQL,skills_Tableau
0,M0001,HR,manager,150000.0,,0,0,0,0,0,0,0,0,0
1,M0002,IT,manager,180000.0,"Java,C++",1,0,1,0,0,0,0,0,0
2,E0001,IT,data scientist,150000.0,"Python,Tableau,SQL",0,0,0,0,1,0,0,1,1
3,E0002,HR,recruiter,130000.0,,0,0,0,0,0,0,0,0,0
4,E0003,IT,backend developer,110000.0,"React,Django",0,1,0,0,0,0,1,0,0
5,E0004,IT,frontend developer,120000.0,"JavaScript,Python",0,0,0,1,1,0,0,0,0
6,E0005,IT,data scientist,135000.0,"R,SQL",0,0,0,0,0,1,0,1,0
7,E0006,IT,data scientist,125000.0,"SQL,Python",0,0,0,0,1,0,0,1,0

In [79]:
df_final = df_final.join(skill_dummy)

In [80]:
df_final.drop('Skills', inplace=True, axis=1)

In [81]:
df_final

,id,department,job,salary,skills_C++,skills_Django,skills_Java,skills_JavaScript,skills_Python,skills_R,skills_React,skills_SQL,skills_Tableau
0,M0001,HR,manager,150000.0,0,0,0,0,0,0,0,0,0
1,M0002,IT,manager,180000.0,1,0,1,0,0,0,0,0,0
2,E0001,IT,data scientist,150000.0,0,0,0,0,1,0,0,1,1
3,E0002,HR,recruiter,130000.0,0,0,0,0,0,0,0,0,0
4,E0003,IT,backend developer,110000.0,0,1,0,0,0,0,1,0,0
5,E0004,IT,frontend developer,120000.0,0,0,0,1,1,0,0,0,0
6,E0005,IT,data scientist,135000.0,0,0,0,0,0,1,0,1,0
7,E0006,IT,data scientist,125000.0,0,0,0,0,1,0,0,1,0

In [82]:
df_final.drop('id', axis=1, inplace=True)
df_final

,department,job,salary,skills_C++,skills_Django,skills_Java,skills_JavaScript,skills_Python,skills_R,skills_React,skills_SQL,skills_Tableau
0,HR,manager,150000.0,0,0,0,0,0,0,0,0,0
1,IT,manager,180000.0,1,0,1,0,0,0,0,0,0
2,IT,data scientist,150000.0,0,0,0,0,1,0,0,1,1
3,HR,recruiter,130000.0,0,0,0,0,0,0,0,0,0
4,IT,backend developer,110000.0,0,1,0,0,0,0,1,0,0
5,IT,frontend developer,120000.0,0,0,0,1,1,0,0,0,0
6,IT,data scientist,135000.0,0,0,0,0,0,1,0,1,0
7,IT,data scientist,125000.0,0,0,0,0,1,0,0,1,0

In [84]:
pd.get_dummies(df_final).T

,0,1,2,3,4,5,6,7
salary,150000.0,180000.0,150000.0,130000.0,110000.0,120000.0,135000.0,125000.0
skills_C++,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0
skills_Django,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0
skills_Java,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0
skills_JavaScript,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0
skills_Python,0.0,0.0,1.0,0.0,0.0,1.0,0.0,1.0
skills_R,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0
skills_React,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0
skills_SQL,0.0,0.0,1.0,0.0,0.0,0.0,1.0,1.0
skills_Tableau,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0
department_HR,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0
department_IT,0.0,1.0,1.0,0.0,1.0,1.0,1.0,1.0
job_backend developer,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0
job_data scientist,0.0,0.0,1.0,0.0,0.0,0.0,1.0,1.0
job_frontend developer,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0
job_manager,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0
job_recruiter,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0

In [86]:
df_final = pd.get_dummies(df_final, drop_first=True)
df_final.T

,0,1,2,3,4,5,6,7
salary,150000.0,180000.0,150000.0,130000.0,110000.0,120000.0,135000.0,125000.0
skills_C++,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0
skills_Django,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0
skills_Java,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0
skills_JavaScript,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0
skills_Python,0.0,0.0,1.0,0.0,0.0,1.0,0.0,1.0
skills_R,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0
skills_React,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0
skills_SQL,0.0,0.0,1.0,0.0,0.0,0.0,1.0,1.0
skills_Tableau,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0
department_IT,0.0,1.0,1.0,0.0,1.0,1.0,1.0,1.0
job_data scientist,0.0,0.0,1.0,0.0,0.0,0.0,1.0,1.0
job_frontend developer,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0
job_manager,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0
job_recruiter,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0

# Working with Time Data

## pd.to_datetime()
https://pandas.pydata.org/docs/reference/api/pandas.to_datetime.html

In [87]:
df = pd.read_csv("time_exercise.csv")
df.head()

   id_product  order_date  product_quantity  product_price  entry_date
0         401  2021-01-23               1.0     541.487603  2018-12-04
1         416  2020-04-02               1.0     131.181818  2018-12-04
2         717  2019-03-10               1.0    2035.488500  2018-12-04
3         778  2019-12-27               1.0     335.988000  2018-12-04
4         826  2020-02-19               1.0     342.292302  2018-12-04

In [88]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 911 entries, 0 to 910
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id_product        911 non-null    int64
 1   order_date        911 non-null    object
 2   product_quantity  911 non-null    float64
 3   product_price     911 non-null    float64
 4   entry_date        911 non-null    object
dtypes: float64(2), int64(1), object(2)
memory usage: 35.7+ KB

In [89]:
df.order_date

0      2021-01-23
1      2020-04-02
2      2019-03-10
3      2019-12-27
4      2020-02-19
          ...
906    2020-11-24
907    2020-11-24
908    2020-11-22
909    2021-01-26
910    2020-12-06
Name: order_date, Length: 911, dtype: object

In [90]:
pd.to_datetime(df.order_date)

0     2021-01-23
1     2020-04-02
2     2019-03-10
3     2019-12-27
4     2020-02-19
         ...
906   2020-11-24
907   2020-11-24
908   2020-11-22
909   2021-01-26
910   2020-12-06
Name: order_date, Length: 911, dtype: datetime64[ns]

In [91]:
df["entry_date"] = pd.to_datetime(df["entry_date"])
df["order_date"] = pd.to_datetime(df["order_date"])

In [92]:
df.head()

   id_product order_date  product_quantity  product_price entry_date
0         401 2021-01-23               1.0     541.487603 2018-12-04
1         416 2020-04-02               1.0     131.181818 2018-12-04
2         717 2019-03-10               1.0    2035.488500 2018-12-04
3         778 2019-12-27               1.0     335.988000 2018-12-04
4         826 2020-02-19               1.0     342.292302 2018-12-04

In [93]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 911 entries, 0 to 910
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id_product        911 non-null    int64
 1   order_date        911 non-null    datetime64[ns]
 2   product_quantity  911 non-null    float64
 3   product_price     911 non-null    float64
 4   entry_date        911 non-null    datetime64[ns]
dtypes: datetime64[ns](2), float64(2), int64(1)
memory usage: 35.7 KB

In [94]:
df.entry_date.min()

Timestamp('2018-12-04 00:00:00')

In [95]:
df.entry_date.max()

Timestamp('2020-11-26 00:00:00')

In [96]:
a = pd.Series(["15-03-2020", "18-05-2019", "24-07-2018"])
a

0    15-03-2020
1    18-05-2019
2    24-07-2018
dtype: object

In [97]:
a.min()  # ascii code considered here!

'15-03-2020'

In [99]:
pd.to_datetime(a, format = '%d-%m-%Y')

0   2020-03-15
1   2019-05-18
2   2018-07-24
dtype: datetime64[ns]

## Series.dt()
Accessor object for datetimelike properties of the Series values.

https://pandas.pydata.org/docs/reference/api/pandas.Series.dt.html

In [102]:
# it can be date, year, quarter, month, week, day, weekday, dayofweek, hour, minute, second, microsecond
df.entry_date.dt.month

0      12
1      12
2      12
3      12
4      12
       ..
906    10
907    10
908    11
909    11
910    11
Name: entry_date, Length: 911, dtype: int64

In [101]:
df.entry_date.dt.day_name()

0        Tuesday
1        Tuesday
2        Tuesday
3        Tuesday
4        Tuesday
         ...
906    Wednesday
907    Wednesday
908       Friday
909      Tuesday
910     Thursday
Name: entry_date, Length: 911, dtype: object

## datetime module
The datetime module supplies classes for manipulating dates and times.

https://docs.python.org/3/library/datetime.html

### class datetime.datetime

A combination of a date and a time. Attributes: year, month, day, hour, minute, second, microsecond, and tzinfo.

In [105]:
from datetime import datetime

In [106]:
datetime.now()

datetime.datetime(2022, 1, 31, 20, 38, 35, 940215)

In [107]:
print(datetime.now())

2022-01-31 20:38:52.666525

In [108]:
print(datetime.today())

2022-01-31 20:39:10.755504

In [109]:
current_datetime = datetime.today()

In [110]:
current_datetime.date()

datetime.date(2022, 1, 31)

In [111]:
current_datetime.year

2022

In [112]:
current_datetime.weekday()

0

In [113]:
current_datetime.isoweekday()

1

### class datetime.timedelta

A duration expressing the difference between two date, time, or datetime instances to microsecond resolution.

In [114]:
from datetime import timedelta

In [115]:
timedelta(days=2)

datetime.timedelta(days=2)

In [116]:
print(timedelta(days=2))

2 days, 0:00:00

In [117]:
print(current_datetime)

2022-01-31 20:40:40.598103

In [118]:
two_days_before = current_datetime-timedelta(days=2)
two_days_before

datetime.datetime(2022, 1, 29, 20, 40, 40, 598103)

In [119]:
current_datetime + timedelta(weeks=2, days=3, hours=4, minutes=10)

datetime.datetime(2022, 2, 18, 0, 50, 40, 598103)

In [120]:
print(f"{'current_date': <15}", current_datetime)
print(f"{'plus': <15}", timedelta(weeks=2, hours=4, minutes=10))
print(f"{'total': <15}", current_datetime+timedelta(weeks=2, days=3, hours=4, minutes=10))

current_date    2022-01-31 20:40:40.598103
plus            14 days, 4:10:00
total           2022-02-18 00:50:40.598103

### strftime()

Converting from date/datetime/timedelta object to string type

https://strftime.org/

In [121]:
print(current_datetime)

2022-01-31 20:40:40.598103

In [122]:
current_datetime.strftime("%Y")

'2022'

In [123]:
year = current_datetime.strftime("%Y")
print("year:", year)
month = current_datetime.strftime("%m")
print("month:", month)
day = current_datetime.strftime("%d")
print("day:", day)
time = current_datetime.strftime("%H:%M:%S")
print("time:", time)
date_time = current_datetime.strftime("%m/%d/%Y, %H:%M:%S")
print("date and time:",date_time)

year: 2022
month: 01
day: 31
time: 20:40:40
date and time: 01/31/2022, 20:40:40

### strptime()

Converting from string type to datetime object

In [124]:
date_string = "12 June, 2018"
date_string

'12 June, 2018'

In [126]:
datetime.strptime(date_string, "%d %B, %Y")

datetime.datetime(2018, 6, 12, 0, 0)

In [127]:
pd.to_datetime(date_string)

Timestamp('2018-06-12 00:00:00')

In [128]:
datetime_object = datetime.strptime(date_string, "%d %B, %Y")
datetime_object

datetime.datetime(2018, 6, 12, 0, 0)

In [130]:
datetime_object.year

2018

### Operation with datetime object

**lets detect the time between first order date and entry date for each product**

In [131]:
df

     id_product order_date  product_quantity  product_price entry_date
0           401 2021-01-23               1.0     541.487603 2018-12-04
1           416 2020-04-02               1.0     131.181818 2018-12-04
2           717 2019-03-10               1.0    2035.488500 2018-12-04
3           778 2019-12-27               1.0     335.988000 2018-12-04
4           826 2020-02-19               1.0     342.292302 2018-12-04
..          ...        ...               ...            ...        ...
906     1536842 2020-11-24               1.0    1186.776860 2020-10-07
907     1536842 2020-11-24               1.0    1186.776860 2020-10-07
908     1536887 2020-11-22               1.0       0.000000 2020-11-13
909     1536952 2021-01-26               1.0     988.429752 2020-11-24
910     1536974 2020-12-06               1.0       0.000000 2020-11-26

[911 rows x 5 columns]

In [132]:
df.order_date-df.entry_date

0     781 days
1     485 days
2      96 days
3     388 days
4     442 days
        ...
906    48 days
907    48 days
908     9 days
909    63 days
910    10 days
Length: 911, dtype: timedelta64[ns]

In [133]:
df["passing_time_to_firstsale"] = df["order_date"] - df["entry_date"]

In [135]:
df["passing_time_to_firstsale"] = df["passing_time_to_firstsale"].astype('str').str.split(" ").str[0].astype('int')

In [138]:
df.groupby('id_product')[["passing_time_to_firstsale"]].min()

            passing_time_to_firstsale
id_product
401                               781
416                               485
717                                96
778                               388
826                               442
...                               ...
1536841                            38
1536842                            48
1536887                             9
1536952                            63
1536974                            10

[498 rows x 1 columns]

In [137]:
len(df)

911

In [143]:
df.groupby('id_product')["passing_time_to_firstsale"].transform('min').sort_values()

879   -213
878   -211
877   -209
876   -170
875   -170
      ...
473    781
0      781
683    785
446    787
408    790
Name: passing_time_to_firstsale, Length: 911, dtype: int32

In [140]:
df["passing_time_to_firstsale"]=df.groupby('id_product')["passing_time_to_firstsale"].transform('min')

In [144]:
df

,id_product,order_date,product_quantity,product_price,entry_date,passing_time_to_firstsale
0,401,2021-01-23,1.0,541.487603,2018-12-04,781
1,416,2020-04-02,1.0,131.181818,2018-12-04,485
2,717,2019-03-10,1.0,2035.488500,2018-12-04,96
3,778,2019-12-27,1.0,335.988000,2018-12-04,388
4,826,2020-02-19,1.0,342.292302,2018-12-04,442
...,...,...,...,...,...,...
906,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48
907,1536842,2020-11-24,1.0,1186.776860,2020-10-07,48
908,1536887,2020-11-22,1.0,0.000000,2020-11-13,9
909,1536952,2021-01-26,1.0,988.429752,2020-11-24,63
910,1536974,2020-12-06,1.0,0.000000,2020-11-26,10

In [147]:
df.sort_values(by='passing_time_to_firstsale', ascending=True)

,id_product,order_date,product_quantity,product_price,entry_date,passing_time_to_firstsale
879,1535922,2020-01-15,1.0,123.140496,2020-08-15,-213
878,1535919,2020-01-17,1.0,23.966942,2020-08-15,-211
877,1535914,2020-01-19,1.0,2795.000000,2020-08-15,-209
876,1535912,2020-10-10,1.0,1051.089406,2020-08-15,-170
875,1535912,2020-04-02,1.0,1177.272727,2020-08-15,-170
...,...,...,...,...,...,...
473,5655,2021-01-23,1.0,417.434820,2018-12-04,781
0,401,2021-01-23,1.0,541.487603,2018-12-04,781
683,12237,2021-01-27,1.0,226.294909,2018-12-04,785
446,5094,2021-01-29,1.0,50.358000,2018-12-04,787
408,4845,2021-02-01,1.0,230.790000,2018-12-04,790

**lets detect the time between last order date and today for each product**

# End of The Session